# WorksetKind Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WorksetKindFilter..::..WorksetKind Property
WorksetKindFilter Class See Also
---
The WorksetKind.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public WorksetKind WorksetKind { get; }
```

Visual Basic
---
```text
Public ReadOnly Property WorksetKind As WorksetKind
	Get
```

Visual C++
---
```text
public:
property WorksetKind WorksetKind {
	WorksetKind get ();
}
```

# See Also
WorksetKindFilter Class
Autodesk.Revit.DB Namespace